# =============================================================================
# Brewfile.workstation - Full development machine packages
# =============================================================================

# Taps
tap "wix/brew"

# =============================================================================
# Cloud / Infra / Toolchains
# =============================================================================
brew "awscli"
brew "commitlint"
brew "cocoapods"
brew "go"
brew "kubectx"
brew "kubernetes-cli"
brew "mysql-client"
brew "postgresql@18"
brew "rbenv"
brew "watchman"

# =============================================================================
# Java / Android
# =============================================================================
cask "android-commandlinetools"
cask "android-platform-tools"
cask "temurin@17"

# =============================================================================
# Browsers
# =============================================================================
cask "google-chrome"
cask "google-chrome@beta"

# =============================================================================
# Editors / Development Apps
# =============================================================================
cask "bruno"
cask "claude-code@latest"
cask "codex"
cask "dbngin"
cask "fork"
cask "gitify"
cask "herd"
cask "lens"
cask "orbstack"
cask "tableplus"
cask "zed"

# =============================================================================
# Productivity / Utilities
# =============================================================================
cask "aws-vpn-client"
cask "boom-3d"
cask "google-drive"
cask "hiddenbar"
cask "keycastr"
cask "lunar"
cask "mouseless"
cask "notion"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "slack@beta"
cask "spotify"
cask "stats"
cask "superwhisper"
cask "telegram"
cask "vnc-viewer"
cask "whatsapp"

# =============================================================================
# Mac App Store
# =============================================================================
mas "Bitwarden", id: 1352778147
mas "GIPHY CAPTURE", id: 668208984
mas "OneAuth", id: 1142928979
mas "Spark", id: 1176895641
