tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "webp"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "commitlint"
brew "php"
brew "composer"
brew "deployer"
brew "git"
brew "gnu-sed"
brew "gradle"
brew "jq"
brew "mackup"
brew "mas"
brew "php@8.1"
brew "python@3.10"
brew "rbenv"
brew "starship"
brew "tmux"
brew "watchman"
brew "wp-cli"
brew "zsh"
cask "adoptopenjdk"
cask "android-file-transfer"
cask "android-platform-tools"
cask "aws-vpn-client"
cask "boom-3d"
cask "discord"
cask "docker"
cask "folx"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-for-powerline"
cask "fork"
cask "gitify"
cask "google-chrome-beta"
cask "google-drive"
cask "hiddenbar"
cask "iina"
cask "istat-menus"
cask "iterm2-beta"
cask "lunar"
cask "messenger"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "react-native-debugger"
cask "sizeup"
cask "slack-beta"
cask "spotify"
cask "tableplus"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "zed-preview"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GIPHY CAPTURE", id: 668208984
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 1284863847
