tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "composer"
brew "git"
brew "mas"
brew "node@12", link: true
brew "php-code-sniffer"
brew "php-cs-fixer"
brew "tmux"
brew "wp-cli"
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "authy"
cask "bbedit"
cask "boom-3d"
cask "caffeine"
cask "discord"
cask "docker"
cask "firefox"
cask "folx"
cask "font-inconsolata-for-powerline"
cask "font-jetbrainsmono-nerd-font"
cask "fork"
cask "google-backup-and-sync"
cask "google-chrome-beta"
cask "iina"
cask "istat-menus"
cask "iterm2-beta"
cask "karabiner-elements"
cask "keybase"
cask "mattermost"
cask "messenger"
cask "notable"
cask "obs"
cask "postman"
cask "qbserve"
cask "sizeup"
cask "slack-beta"
cask "smartsvn"
cask "spotify"
cask "tableplus"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "ticktick"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "GIPHY CAPTURE", id: 668208984
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 1284863847
