# =============================================================================
# Brewfile.workstation - Full development machine packages
# =============================================================================

# Taps
tap "wix/brew"

# =============================================================================
# Cloud / Infra / Toolchains
# =============================================================================
brew "awscli"
brew "commitlint"
brew "cocoapods"
brew "go"
brew "kubectx"
brew "kubernetes-cli"
brew "mysql-client"
brew "postgresql@18"
brew "rbenv"
brew "watchman"

# =============================================================================
# Java / Android
# =============================================================================
cask "android-commandlinetools"
cask "android-platform-tools"
cask "temurin@17"

# =============================================================================
# Browsers
# =============================================================================
cask "google-chrome"
cask "google-chrome@beta"

# =============================================================================
# Editors / Development Apps
# =============================================================================
cask "bruno"
cask "claude"
cask "claude-code@latest"
cask "codex"
cask "codexbar"
cask "copilot-cli"
cask "dbngin"
cask "fork"
cask "gitify"
cask "herd"
cask "lens"
cask "orbstack"
cask "react-native-debugger"
cask "tableplus"
cask "visual-studio-code"
cask "zed"

# =============================================================================
# Productivity / Utilities
# =============================================================================
cask "aws-vpn-client"
cask "boom-3d"
cask "discord"
cask "google-drive"
cask "hiddenbar"
cask "keycastr"
cask "lunar"
cask "mouseless"
cask "notion"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "slack@beta"
cask "spotify"
cask "stats"
cask "superwhisper"
cask "telegram"
cask "ticktick"
cask "vnc-viewer"
cask "whatsapp"

# =============================================================================
# VS Code Extensions
# =============================================================================
vscode "alefragnani.project-manager"
vscode "austenc.tailwind-docs"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "calebporzio.better-phpunit"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql-syntax"
vscode "kasik96.latte"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "open-southeners.laravel-pint"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "shevaua.phpcs"
vscode "tamasfe.even-better-toml"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"

# =============================================================================
# Mac App Store
# =============================================================================
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GIPHY CAPTURE", id: 668208984
mas "OneAuth", id: 1142928979
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "Unsplash Wallpapers", id: 1284863847
